// medicalProcedureRoutes.js

const express = require('express');
const router = express.Router();

// Маршрут для создания новой медицинской процедуры
//router.post('/', (req, res) => {
    // Логика создания новой медицинской процедуры
//});

// Маршрут для получения списка всех медицинских процедур
router.get('/', (req, res) => {
    // Логика получения списка всех медицинских процедур
});

// Маршрут для получения информации о конкретной медицинской процедуре
//router.get('/:id', (req, res) => {
    // Логика получения информации о конкретной медицинской процедуре
//});

// Маршрут для обновления информации о медицинской процедуре
router.put('/:id', (req, res) => {
    // Логика обновления информации о медицинской процедуре
});

// Маршрут для удаления медицинской процедуры
//router.delete('/:id', (req, res) => {
    // Логика удаления медицинской процедуры
//});

module.exports = router;
